# -*- encoding: utf-8 -*-
'''
@File    :   游戏海报.py
@Time    :   2020/02/27 10:44:20
@Author  :   Zhang tao 
@Version :   1.0
@Desc    :   游戏海报.py
'''

'''
题目描述
小明有26种游戏海报，用小写字母"a"到"z"表示。小明会把游戏海报装订成册（可能有重复的海报），册子可以用一个字符串来表示，每个字符就表示对应的海报，例如abcdea。小明现在想做一些“特别版”，然后卖掉。特别版就是会从所有海报（26种）中随机选一张，加入到册子的任意一个位置。
那现在小明手里已经有一种海报册子，再插入一张新的海报后，他一共可以组成多少不同的海报册子呢？
输入描述:
海报册子的字符串表示，1 <= 字符串长度<= 20
输出描述:
一个整数，表示可以组成的不同的海报册子种类数
示例1
输入
a
输出
51
'''
'''
在字符串左右中间都插入一个字符：
(a)aaa,a(a)aa,aa(a)a,aaa(a)
然后减去重复的个数，其正好为字符串的长度

这是一道排列问题，其中有固定顺序的字符串我们只需要知道他的长度即可，
然后根据长度计算可以插空的位置个数再减去重复次数即可，
例如字符串"a"在左边插入a和右边插入a都是"aa"因此重复了一次，
可以推断重复次数和字符串个数相同。
'''
s=str(input().strip());
le=len(s);
l=(le+1)*26-le
print(l)