# -*- encoding: utf-8 -*-
'''
@File    :   数对.py
@Time    :   2020/02/06 16:41:42
@Author  :   Zhang tao 
@Version :   1.0
@Desc    :   None
'''

'''
题目描述
牛牛以前在老师那里得到了一个正整数数对(x, y), 牛牛忘记他们具体是多少了。

但是牛牛记得老师告诉过他x和y均不大于n, 并且x除以y的余数大于等于k。
牛牛希望你能帮他计算一共有多少个可能的数对。

输入描述:
输入包括两个正整数n,k(1 <= n <= 10^5, 0 <= k <= n - 1)。
输出描述:
对于每个测试用例, 输出一个正整数表示可能的数对数量。
示例1
输入
5 2
输出
7
'''
'''
假设 n=13,k=3; 则
                y取值[4,13],当y取值[0,3]时,x%y<3;
                当y=5时，符合条件的是:
                第e组(e:[1,n//y])       [x,y]
                 1[1--5]                 [3,5]
                 1                      [4,5]
                 2[6--10]                 [8,5]
                 2                        [9,5]
                 3                       [13,5]
 我们将上述结果分两种来计算：
1）在n/y=2次循环内，x=[0-5]和x=[6-10]中分别有y-k个是余数>=k的，因此是n/y*(y-k)
2）在2次循环外，x=[11-13]，x有n%y=3种取值，其中有n%y-k+1个余数>=k；如果没有余数>=k的则count=0                
'''

import sys;
n,k=map(int,sys.stdin.readline().split());
co=0;
if k==0:
    co=n*n;
else:
    for i in range(k+1,n+1):
        a1=n//i;
        a2=(i-k);
        a3=max(n%i-k+1,0);
        co+=a1*a2+a3;
print(co)